analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_CTRL0_IRXM_POS                       3 /**< CTRL0_IRXM Position */
#define MXC_F_I2C_CTRL0_IRXM                           ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_IRXM_POS)) /**< CTRL0_IRXM Mask */
#define MXC_V_I2C_CTRL0_IRXM_DIS                       ((uint32_t)0x0UL) /**< CTRL0_IRXM_DIS Value */
#define MXC_S_I2C_CTRL0_IRXM_DIS                       (MXC_V_I2C_CTRL0_IRXM_DIS << MXC_F_I2C_CTRL0_IRXM_POS) /**< CTRL0_IRXM_DIS Setting */
#define MXC_V_I2C_CTRL0_IRXM_EN                        ((uint32_t)0x1UL) /**< CTRL0_IRXM_EN Value */
#define MXC_S_I2C_CTRL0_IRXM_EN                        (MXC_V_I2C_CTRL0_IRXM_EN << MXC_F_I2C_CTRL0_IRXM_POS) /**< CTRL0_IRXM_EN Setting */

#define MXC_F_I2C_CTRL0_ACK_POS                        4 /**< CTRL0_ACK Position */
#define MXC_F_I2C_CTRL0_ACK                            ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_ACK_POS)) /**< CTRL0_ACK Mask */
#define MXC_V_I2C_CTRL0_ACK_ACK                        ((uint32_t)0x0UL) /**< CTRL0_ACK_ACK Value */
#define MXC_S_I2C_CTRL0_ACK_ACK                        (MXC_V_I2C_CTRL0_ACK_ACK << MXC_F_I2C_CTRL0_ACK_POS) /**< CTRL0_ACK_ACK Setting */
#define MXC_V_I2C_CTRL0_ACK_NACK                       ((uint32_t)0x1UL) /**< CTRL0_ACK_NACK Value */
#define MXC_S_I2C_CTRL0_ACK_NACK                       (MXC_V_I2C_CTRL0_ACK_NACK << MXC_F_I2C_CTRL0_ACK_POS) /**< CTRL0_ACK_NACK Setting */

#define MXC_F_I2C_CTRL0_SCL_OUT_POS                    6 /**< CTRL0_SCL_OUT Position */
#define MXC_F_I2C_CTRL0_SCL_OUT                        ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SCL_OUT_POS)) /**< CTRL0_SCL_OUT Mask */
#define MXC_V_I2C_CTRL0_SCL_OUT_LOW                    ((uint32_t)0x0UL) /**< CTRL0_SCL_OUT_LOW Value */
#define MXC_S_I2C_CTRL0_SCL_OUT_LOW                    (MXC_V_I2C_CTRL0_SCL_OUT_LOW << MXC_F_I2C_CTRL0_SCL_OUT_POS) /**< CTRL0_SCL_OUT_LOW Setting */
#define MXC_V_I2C_CTRL0_SCL_OUT_HIGH                   ((uint32_t)0x1UL) /**< CTRL0_SCL_OUT_HIGH Value */
#define MXC_S_I2C_CTRL0_SCL_OUT_HIGH                   (MXC_V_I2C_CTRL0_SCL_OUT_HIGH << MXC_F_I2C_CTRL0_SCL_OUT_POS) /**< CTRL0_SCL_OUT_HIGH Setting */

#define MXC_F_I2C_CTRL0_SDA_OUT_POS                    7 /**< CTRL0_SDA_OUT Position */
#define MXC_F_I2C_CTRL0_SDA_OUT                        ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SDA_OUT_POS)) /**< CTRL0_SDA_OUT Mask */
#define MXC_V_I2C_CTRL0_SDA_OUT_LOW                    ((uint32_t)0x0UL) /**< CTRL0_SDA_OUT_LOW Value */
#define MXC_S_I2C_CTRL0_SDA_OUT_LOW                    (MXC_V_I2C_CTRL0_SDA_OUT_LOW << MXC_F_I2C_CTRL0_SDA_OUT_POS) /**< CTRL0_SDA_OUT_LOW Setting */
#define MXC_V_I2C_CTRL0_SDA_OUT_HIGH                   ((uint32_t)0x1UL) /**< CTRL0_SDA_OUT_HIGH Value */
#define MXC_S_I2C_CTRL0_SDA_OUT_HIGH                   (MXC_V_I2C_CTRL0_SDA_OUT_HIGH << MXC_F_I2C_CTRL0_SDA_OUT_POS) /**< CTRL0_SDA_OUT_HIGH Setting */

#define MXC_F_I2C_CTRL0_SCL_POS                        8 /**< CTRL0_SCL Position */
#define MXC_F_I2C_CTRL0_SCL                            ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SCL_POS)) /**< CTRL0_SCL Mask */
#define MXC_V_I2C_CTRL0_SCL_LOW                        ((uint32_t)0x0UL) /**< CTRL0_SCL_LOW Value */
#define MXC_S_I2C_CTRL0_SCL_LOW                        (MXC_V_I2C_CTRL0_SCL_LOW << MXC_F_I2C_CTRL0_SCL_POS) /**< CTRL0_SCL_LOW Setting */
#define MXC_V_I2C_CTRL0_SCL_HIGH                       ((uint32_t)0x1UL) /**< CTRL0_SCL_HIGH Value */
#define MXC_S_I2C_CTRL0_SCL_HIGH                       (MXC_V_I2C_CTRL0_SCL_HIGH << MXC_F_I2C_CTRL0_SCL_POS) /**< CTRL0_SCL_HIGH Setting */

#define MXC_F_I2C_CTRL0_SDA_POS                        9 /**< CTRL0_SDA Position */
#define MXC_F_I2C_CTRL0_SDA                            ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SDA_POS)) /**< CTRL0_SDA Mask */
#define MXC_V_I2C_CTRL0_SDA_LOW                        ((uint32_t)0x0UL) /**< CTRL0_SDA_LOW Value */
#define MXC_S_I2C_CTRL0_SDA_LOW                        (MXC_V_I2C_CTRL0_SDA_LOW << MXC_F_I2C_CTRL0_SDA_POS) /**< CTRL0_SDA_LOW Setting */
#define MXC_V_I2C_CTRL0_SDA_HIGH                       ((uint32_t)0x1UL) /**< CTRL0_SDA_HIGH Value */
#define MXC_S_I2C_CTRL0_SDA_HIGH                       (MXC_V_I2C_CTRL0_SDA_HIGH << MXC_F_I2C_CTRL0_SDA_POS) /**< CTRL0_SDA_HIGH Setting */

#define MXC_F_I2C_CTRL0_SWOE_POS                       10 /**< CTRL0_SWOE Position */
#define MXC_F_I2C_CTRL0_SWOE                           ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SWOE_POS)) /**< CTRL0_SWOE Mask */
#define MXC_V_I2C_CTRL0_SWOE_DIS                       ((uint32_t)0x0UL) /**< CTRL0_SWOE_DIS Value */
#define MXC_S_I2C_CTRL0_SWOE_DIS                       (MXC_V_I2C_CTRL0_SWOE_DIS << MXC_F_I2C_CTRL0_SWOE_POS) /**< CTRL0_SWOE_DIS Setting */
#define MXC_V_I2C_CTRL0_SWOE_EN                        ((uint32_t)0x1UL) /**< CTRL0_SWOE_EN Value */
#define MXC_S_I2C_CTRL0_SWOE_EN                        (MXC_V_I2C_CTRL0_SWOE_EN << MXC_F_I2C_CTRL0_SWOE_POS) /**< CTRL0_SWOE_EN Setting */

#define MXC_F_I2C_CTRL0_READ_POS                       11 /**< CTRL0_READ Position */
#define MXC_F_I2C_CTRL0_READ                           ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_READ_POS)) /**< CTRL0_READ Mask */
#define MXC_V_I2C_CTRL0_READ_WRITE                     ((uint32_t)0x0UL) /**< CTRL0_READ_WRITE Value */
#define MXC_S_I2C_CTRL0_READ_WRITE                     (MXC_V_I2C_CTRL0_READ_WRITE << MXC_F_I2C_CTRL0_READ_POS) /**< CTRL0_READ_WRITE Setting */
#define MXC_V_I2C_CTRL0_READ_READ                      ((uint32_t)0x1UL) /**< CTRL0_READ_READ Value */
#define MXC_S_I2C_CTRL0_READ_READ                      (MXC_V_I2C_CTRL0_READ_READ << MXC_F_I2C_CTRL0_READ_POS) /**< CTRL0_READ_READ Setting */

#define MXC_F_I2C_CTRL0_SCL_STRD_POS                   12 /**< CTRL0_SCL_STRD Position */
#define MXC_F_I2C_CTRL0_SCL_STRD                       ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SCL_STRD_POS)) /**< CTRL0_SCL_STRD Mask */
#define MXC_V_I2C_CTRL0_SCL_STRD_EN                    ((uint32_t)0x0UL) /**< CTRL0_SCL_STRD_EN Value */
#define MXC_S_I2C_CTRL0_SCL_STRD_EN                    (MXC_V_I2C_CTRL0_SCL_STRD_EN << MXC_F_I2C_CTRL0_SCL_STRD_POS) /**< CTRL0_SCL_STRD_EN Setting */
#define MXC_V_I2C_CTRL0_SCL_STRD_DIS                   ((uint32_t)0x1UL) /**< CTRL0_SCL_STRD_DIS Value */
#define MXC_S_I2C_CTRL0_SCL_STRD_DIS                   (MXC_V_I2C_CTRL0_SCL_STRD_DIS << MXC_F_I2C_CTRL0_SCL_STRD_POS) /**< CTRL0_SCL_STRD_DIS Setting */

#define MXC_F_I2C_CTRL0_SCL_PPM_POS                    13 /**< CTRL0_SCL_PPM Position */
#define MXC_F_I2C_CTRL0_SCL_PPM                        ((uint32_t)(0x1UL << MXC_F_I2C_CTRL0_SCL_PPM_POS)) /**< CTRL0_SCL_PPM Mask */
#define MXC_V_I2C_CTRL0_SCL_PPM_DIS                    ((uint32_t)0x0UL) /**< CTRL0_SCL_PPM_DIS Value */
#define MXC_S_I2C_CTRL0_SCL_PPM_DIS                    (MXC_V_I2C_CTRL0_SCL_PPM_DIS << MXC_F_I2C_CTRL0_SCL_PPM_POS) /**< CTRL0_SCL_PPM_DIS Setting */
#define MXC_V_I2C_CTRL0_SCL_PPM_EN                     ((uint32_t)0x1UL) /**< CTRL0_SCL_PPM_EN Value */
#define MXC_S_I2C_CTRL0_SCL_PPM_EN                     (MXC_V_I2C_CTRL0_SCL_PPM_EN << MXC_F_I2C_CTRL0_SCL_PPM_POS) /**< CTRL0_SCL_PPM_EN Setting */

