analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
/**@} end of group I2C_CTRL0_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_STAT I2C_STAT
 * @brief    Status Register.
 * @{
 */
#define MXC_F_I2C_STAT_BUSY_POS                        0 /**< STAT_BUSY Position */
#define MXC_F_I2C_STAT_BUSY                            ((uint32_t)(0x1UL << MXC_F_I2C_STAT_BUSY_POS)) /**< STAT_BUSY Mask */
#define MXC_V_I2C_STAT_BUSY_IDLE                       ((uint32_t)0x0UL) /**< STAT_BUSY_IDLE Value */
#define MXC_S_I2C_STAT_BUSY_IDLE                       (MXC_V_I2C_STAT_BUSY_IDLE << MXC_F_I2C_STAT_BUSY_POS) /**< STAT_BUSY_IDLE Setting */
#define MXC_V_I2C_STAT_BUSY_BUSY                       ((uint32_t)0x1UL) /**< STAT_BUSY_BUSY Value */
#define MXC_S_I2C_STAT_BUSY_BUSY                       (MXC_V_I2C_STAT_BUSY_BUSY << MXC_F_I2C_STAT_BUSY_POS) /**< STAT_BUSY_BUSY Setting */

#define MXC_F_I2C_STAT_RXE_POS                         1 /**< STAT_RXE Position */
#define MXC_F_I2C_STAT_RXE                             ((uint32_t)(0x1UL << MXC_F_I2C_STAT_RXE_POS)) /**< STAT_RXE Mask */
#define MXC_V_I2C_STAT_RXE_NOT_EMPTY                   ((uint32_t)0x0UL) /**< STAT_RXE_NOT_EMPTY Value */
#define MXC_S_I2C_STAT_RXE_NOT_EMPTY                   (MXC_V_I2C_STAT_RXE_NOT_EMPTY << MXC_F_I2C_STAT_RXE_POS) /**< STAT_RXE_NOT_EMPTY Setting */
#define MXC_V_I2C_STAT_RXE_EMPTY                       ((uint32_t)0x1UL) /**< STAT_RXE_EMPTY Value */
#define MXC_S_I2C_STAT_RXE_EMPTY                       (MXC_V_I2C_STAT_RXE_EMPTY << MXC_F_I2C_STAT_RXE_POS) /**< STAT_RXE_EMPTY Setting */

#define MXC_F_I2C_STAT_RXF_POS                         2 /**< STAT_RXF Position */
#define MXC_F_I2C_STAT_RXF                             ((uint32_t)(0x1UL << MXC_F_I2C_STAT_RXF_POS)) /**< STAT_RXF Mask */
#define MXC_V_I2C_STAT_RXF_NOT_FULL                    ((uint32_t)0x0UL) /**< STAT_RXF_NOT_FULL Value */
#define MXC_S_I2C_STAT_RXF_NOT_FULL                    (MXC_V_I2C_STAT_RXF_NOT_FULL << MXC_F_I2C_STAT_RXF_POS) /**< STAT_RXF_NOT_FULL Setting */
#define MXC_V_I2C_STAT_RXF_FULL                        ((uint32_t)0x1UL) /**< STAT_RXF_FULL Value */
#define MXC_S_I2C_STAT_RXF_FULL                        (MXC_V_I2C_STAT_RXF_FULL << MXC_F_I2C_STAT_RXF_POS) /**< STAT_RXF_FULL Setting */

#define MXC_F_I2C_STAT_TXE_POS                         3 /**< STAT_TXE Position */
#define MXC_F_I2C_STAT_TXE                             ((uint32_t)(0x1UL << MXC_F_I2C_STAT_TXE_POS)) /**< STAT_TXE Mask */
#define MXC_V_I2C_STAT_TXE_NOT_EMPTY                   ((uint32_t)0x0UL) /**< STAT_TXE_NOT_EMPTY Value */
#define MXC_S_I2C_STAT_TXE_NOT_EMPTY                   (MXC_V_I2C_STAT_TXE_NOT_EMPTY << MXC_F_I2C_STAT_TXE_POS) /**< STAT_TXE_NOT_EMPTY Setting */
#define MXC_V_I2C_STAT_TXE_EMPTY                       ((uint32_t)0x1UL) /**< STAT_TXE_EMPTY Value */
#define MXC_S_I2C_STAT_TXE_EMPTY                       (MXC_V_I2C_STAT_TXE_EMPTY << MXC_F_I2C_STAT_TXE_POS) /**< STAT_TXE_EMPTY Setting */

#define MXC_F_I2C_STAT_TXF_POS                         4 /**< STAT_TXF Position */
#define MXC_F_I2C_STAT_TXF                             ((uint32_t)(0x1UL << MXC_F_I2C_STAT_TXF_POS)) /**< STAT_TXF Mask */
#define MXC_V_I2C_STAT_TXF_NOT_FULL                    ((uint32_t)0x0UL) /**< STAT_TXF_NOT_FULL Value */
#define MXC_S_I2C_STAT_TXF_NOT_FULL                    (MXC_V_I2C_STAT_TXF_NOT_FULL << MXC_F_I2C_STAT_TXF_POS) /**< STAT_TXF_NOT_FULL Setting */
#define MXC_V_I2C_STAT_TXF_FULL                        ((uint32_t)0x1UL) /**< STAT_TXF_FULL Value */
#define MXC_S_I2C_STAT_TXF_FULL                        (MXC_V_I2C_STAT_TXF_FULL << MXC_F_I2C_STAT_TXF_POS) /**< STAT_TXF_FULL Setting */

#define MXC_F_I2C_STAT_CKMD_POS                        5 /**< STAT_CKMD Position */
#define MXC_F_I2C_STAT_CKMD                            ((uint32_t)(0x1UL << MXC_F_I2C_STAT_CKMD_POS)) /**< STAT_CKMD Mask */
#define MXC_V_I2C_STAT_CKMD_SCL_NOT_ACTIVE             ((uint32_t)0x0UL) /**< STAT_CKMD_SCL_NOT_ACTIVE Value */
#define MXC_S_I2C_STAT_CKMD_SCL_NOT_ACTIVE             (MXC_V_I2C_STAT_CKMD_SCL_NOT_ACTIVE << MXC_F_I2C_STAT_CKMD_POS) /**< STAT_CKMD_SCL_NOT_ACTIVE Setting */
#define MXC_V_I2C_STAT_CKMD_SCL_ACTIVE                 ((uint32_t)0x1UL) /**< STAT_CKMD_SCL_ACTIVE Value */
#define MXC_S_I2C_STAT_CKMD_SCL_ACTIVE                 (MXC_V_I2C_STAT_CKMD_SCL_ACTIVE << MXC_F_I2C_STAT_CKMD_POS) /**< STAT_CKMD_SCL_ACTIVE Setting */

/**@} end of group I2C_STAT_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_INT_FL0 I2C_INT_FL0
 * @brief    Interrupt Status Register.
 * @{
 */
#define MXC_F_I2C_INT_FL0_DONEI_POS                    0 /**< INT_FL0_DONEI Position */
#define MXC_F_I2C_INT_FL0_DONEI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_DONEI_POS)) /**< INT_FL0_DONEI Mask */
#define MXC_V_I2C_INT_FL0_DONEI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_DONEI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_DONEI_INACTIVE               (MXC_V_I2C_INT_FL0_DONEI_INACTIVE << MXC_F_I2C_INT_FL0_DONEI_POS) /**< INT_FL0_DONEI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_DONEI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_DONEI_PENDING Value */
#define MXC_S_I2C_INT_FL0_DONEI_PENDING                (MXC_V_I2C_INT_FL0_DONEI_PENDING << MXC_F_I2C_INT_FL0_DONEI_POS) /**< INT_FL0_DONEI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_IRXMI_POS                    1 /**< INT_FL0_IRXMI Position */
#define MXC_F_I2C_INT_FL0_IRXMI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_IRXMI_POS)) /**< INT_FL0_IRXMI Mask */
#define MXC_V_I2C_INT_FL0_IRXMI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_IRXMI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_IRXMI_INACTIVE               (MXC_V_I2C_INT_FL0_IRXMI_INACTIVE << MXC_F_I2C_INT_FL0_IRXMI_POS) /**< INT_FL0_IRXMI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_IRXMI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_IRXMI_PENDING Value */
#define MXC_S_I2C_INT_FL0_IRXMI_PENDING                (MXC_V_I2C_INT_FL0_IRXMI_PENDING << MXC_F_I2C_INT_FL0_IRXMI_POS) /**< INT_FL0_IRXMI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_GCI_POS                      2 /**< INT_FL0_GCI Position */
#define MXC_F_I2C_INT_FL0_GCI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_GCI_POS)) /**< INT_FL0_GCI Mask */
#define MXC_V_I2C_INT_FL0_GCI_INACTIVE                 ((uint32_t)0x0UL) /**< INT_FL0_GCI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_GCI_INACTIVE                 (MXC_V_I2C_INT_FL0_GCI_INACTIVE << MXC_F_I2C_INT_FL0_GCI_POS) /**< INT_FL0_GCI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_GCI_PENDING                  ((uint32_t)0x1UL) /**< INT_FL0_GCI_PENDING Value */
#define MXC_S_I2C_INT_FL0_GCI_PENDING                  (MXC_V_I2C_INT_FL0_GCI_PENDING << MXC_F_I2C_INT_FL0_GCI_POS) /**< INT_FL0_GCI_PENDING Setting */

