analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_INT_FL0_AMI_POS                      3 /**< INT_FL0_AMI Position */
#define MXC_F_I2C_INT_FL0_AMI                          ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_AMI_POS)) /**< INT_FL0_AMI Mask */
#define MXC_V_I2C_INT_FL0_AMI_INACTIVE                 ((uint32_t)0x0UL) /**< INT_FL0_AMI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_AMI_INACTIVE                 (MXC_V_I2C_INT_FL0_AMI_INACTIVE << MXC_F_I2C_INT_FL0_AMI_POS) /**< INT_FL0_AMI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_AMI_PENDING                  ((uint32_t)0x1UL) /**< INT_FL0_AMI_PENDING Value */
#define MXC_S_I2C_INT_FL0_AMI_PENDING                  (MXC_V_I2C_INT_FL0_AMI_PENDING << MXC_F_I2C_INT_FL0_AMI_POS) /**< INT_FL0_AMI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_RXTHI_POS                    4 /**< INT_FL0_RXTHI Position */
#define MXC_F_I2C_INT_FL0_RXTHI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_RXTHI_POS)) /**< INT_FL0_RXTHI Mask */
#define MXC_V_I2C_INT_FL0_RXTHI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_RXTHI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_RXTHI_INACTIVE               (MXC_V_I2C_INT_FL0_RXTHI_INACTIVE << MXC_F_I2C_INT_FL0_RXTHI_POS) /**< INT_FL0_RXTHI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_RXTHI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_RXTHI_PENDING Value */
#define MXC_S_I2C_INT_FL0_RXTHI_PENDING                (MXC_V_I2C_INT_FL0_RXTHI_PENDING << MXC_F_I2C_INT_FL0_RXTHI_POS) /**< INT_FL0_RXTHI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_TXTHI_POS                    5 /**< INT_FL0_TXTHI Position */
#define MXC_F_I2C_INT_FL0_TXTHI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_TXTHI_POS)) /**< INT_FL0_TXTHI Mask */
#define MXC_V_I2C_INT_FL0_TXTHI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_TXTHI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_TXTHI_INACTIVE               (MXC_V_I2C_INT_FL0_TXTHI_INACTIVE << MXC_F_I2C_INT_FL0_TXTHI_POS) /**< INT_FL0_TXTHI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_TXTHI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_TXTHI_PENDING Value */
#define MXC_S_I2C_INT_FL0_TXTHI_PENDING                (MXC_V_I2C_INT_FL0_TXTHI_PENDING << MXC_F_I2C_INT_FL0_TXTHI_POS) /**< INT_FL0_TXTHI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_STOPI_POS                    6 /**< INT_FL0_STOPI Position */
#define MXC_F_I2C_INT_FL0_STOPI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_STOPI_POS)) /**< INT_FL0_STOPI Mask */
#define MXC_V_I2C_INT_FL0_STOPI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_STOPI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_STOPI_INACTIVE               (MXC_V_I2C_INT_FL0_STOPI_INACTIVE << MXC_F_I2C_INT_FL0_STOPI_POS) /**< INT_FL0_STOPI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_STOPI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_STOPI_PENDING Value */
#define MXC_S_I2C_INT_FL0_STOPI_PENDING                (MXC_V_I2C_INT_FL0_STOPI_PENDING << MXC_F_I2C_INT_FL0_STOPI_POS) /**< INT_FL0_STOPI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_ADRACKI_POS                  7 /**< INT_FL0_ADRACKI Position */
#define MXC_F_I2C_INT_FL0_ADRACKI                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_ADRACKI_POS)) /**< INT_FL0_ADRACKI Mask */
#define MXC_V_I2C_INT_FL0_ADRACKI_INACTIVE             ((uint32_t)0x0UL) /**< INT_FL0_ADRACKI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_ADRACKI_INACTIVE             (MXC_V_I2C_INT_FL0_ADRACKI_INACTIVE << MXC_F_I2C_INT_FL0_ADRACKI_POS) /**< INT_FL0_ADRACKI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_ADRACKI_PENDING              ((uint32_t)0x1UL) /**< INT_FL0_ADRACKI_PENDING Value */
#define MXC_S_I2C_INT_FL0_ADRACKI_PENDING              (MXC_V_I2C_INT_FL0_ADRACKI_PENDING << MXC_F_I2C_INT_FL0_ADRACKI_POS) /**< INT_FL0_ADRACKI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_ARBERI_POS                   8 /**< INT_FL0_ARBERI Position */
#define MXC_F_I2C_INT_FL0_ARBERI                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_ARBERI_POS)) /**< INT_FL0_ARBERI Mask */
#define MXC_V_I2C_INT_FL0_ARBERI_INACTIVE              ((uint32_t)0x0UL) /**< INT_FL0_ARBERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_ARBERI_INACTIVE              (MXC_V_I2C_INT_FL0_ARBERI_INACTIVE << MXC_F_I2C_INT_FL0_ARBERI_POS) /**< INT_FL0_ARBERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_ARBERI_PENDING               ((uint32_t)0x1UL) /**< INT_FL0_ARBERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_ARBERI_PENDING               (MXC_V_I2C_INT_FL0_ARBERI_PENDING << MXC_F_I2C_INT_FL0_ARBERI_POS) /**< INT_FL0_ARBERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_TOERI_POS                    9 /**< INT_FL0_TOERI Position */
#define MXC_F_I2C_INT_FL0_TOERI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_TOERI_POS)) /**< INT_FL0_TOERI Mask */
#define MXC_V_I2C_INT_FL0_TOERI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_TOERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_TOERI_INACTIVE               (MXC_V_I2C_INT_FL0_TOERI_INACTIVE << MXC_F_I2C_INT_FL0_TOERI_POS) /**< INT_FL0_TOERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_TOERI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_TOERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_TOERI_PENDING                (MXC_V_I2C_INT_FL0_TOERI_PENDING << MXC_F_I2C_INT_FL0_TOERI_POS) /**< INT_FL0_TOERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_ADRERI_POS                   10 /**< INT_FL0_ADRERI Position */
#define MXC_F_I2C_INT_FL0_ADRERI                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_ADRERI_POS)) /**< INT_FL0_ADRERI Mask */
#define MXC_V_I2C_INT_FL0_ADRERI_INACTIVE              ((uint32_t)0x0UL) /**< INT_FL0_ADRERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_ADRERI_INACTIVE              (MXC_V_I2C_INT_FL0_ADRERI_INACTIVE << MXC_F_I2C_INT_FL0_ADRERI_POS) /**< INT_FL0_ADRERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_ADRERI_PENDING               ((uint32_t)0x1UL) /**< INT_FL0_ADRERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_ADRERI_PENDING               (MXC_V_I2C_INT_FL0_ADRERI_PENDING << MXC_F_I2C_INT_FL0_ADRERI_POS) /**< INT_FL0_ADRERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_DATAERI_POS                  11 /**< INT_FL0_DATAERI Position */
#define MXC_F_I2C_INT_FL0_DATAERI                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_DATAERI_POS)) /**< INT_FL0_DATAERI Mask */
#define MXC_V_I2C_INT_FL0_DATAERI_INACTIVE             ((uint32_t)0x0UL) /**< INT_FL0_DATAERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_DATAERI_INACTIVE             (MXC_V_I2C_INT_FL0_DATAERI_INACTIVE << MXC_F_I2C_INT_FL0_DATAERI_POS) /**< INT_FL0_DATAERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_DATAERI_PENDING              ((uint32_t)0x1UL) /**< INT_FL0_DATAERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_DATAERI_PENDING              (MXC_V_I2C_INT_FL0_DATAERI_PENDING << MXC_F_I2C_INT_FL0_DATAERI_POS) /**< INT_FL0_DATAERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_DNRERI_POS                   12 /**< INT_FL0_DNRERI Position */
#define MXC_F_I2C_INT_FL0_DNRERI                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_DNRERI_POS)) /**< INT_FL0_DNRERI Mask */
#define MXC_V_I2C_INT_FL0_DNRERI_INACTIVE              ((uint32_t)0x0UL) /**< INT_FL0_DNRERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_DNRERI_INACTIVE              (MXC_V_I2C_INT_FL0_DNRERI_INACTIVE << MXC_F_I2C_INT_FL0_DNRERI_POS) /**< INT_FL0_DNRERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_DNRERI_PENDING               ((uint32_t)0x1UL) /**< INT_FL0_DNRERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_DNRERI_PENDING               (MXC_V_I2C_INT_FL0_DNRERI_PENDING << MXC_F_I2C_INT_FL0_DNRERI_POS) /**< INT_FL0_DNRERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_STRTERI_POS                  13 /**< INT_FL0_STRTERI Position */
#define MXC_F_I2C_INT_FL0_STRTERI                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_STRTERI_POS)) /**< INT_FL0_STRTERI Mask */
#define MXC_V_I2C_INT_FL0_STRTERI_INACTIVE             ((uint32_t)0x0UL) /**< INT_FL0_STRTERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_STRTERI_INACTIVE             (MXC_V_I2C_INT_FL0_STRTERI_INACTIVE << MXC_F_I2C_INT_FL0_STRTERI_POS) /**< INT_FL0_STRTERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_STRTERI_PENDING              ((uint32_t)0x1UL) /**< INT_FL0_STRTERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_STRTERI_PENDING              (MXC_V_I2C_INT_FL0_STRTERI_PENDING << MXC_F_I2C_INT_FL0_STRTERI_POS) /**< INT_FL0_STRTERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_STOPERI_POS                  14 /**< INT_FL0_STOPERI Position */
#define MXC_F_I2C_INT_FL0_STOPERI                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_STOPERI_POS)) /**< INT_FL0_STOPERI Mask */
#define MXC_V_I2C_INT_FL0_STOPERI_INACTIVE             ((uint32_t)0x0UL) /**< INT_FL0_STOPERI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_STOPERI_INACTIVE             (MXC_V_I2C_INT_FL0_STOPERI_INACTIVE << MXC_F_I2C_INT_FL0_STOPERI_POS) /**< INT_FL0_STOPERI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_STOPERI_PENDING              ((uint32_t)0x1UL) /**< INT_FL0_STOPERI_PENDING Value */
#define MXC_S_I2C_INT_FL0_STOPERI_PENDING              (MXC_V_I2C_INT_FL0_STOPERI_PENDING << MXC_F_I2C_INT_FL0_STOPERI_POS) /**< INT_FL0_STOPERI_PENDING Setting */

#define MXC_F_I2C_INT_FL0_TXLOI_POS                    15 /**< INT_FL0_TXLOI Position */
#define MXC_F_I2C_INT_FL0_TXLOI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL0_TXLOI_POS)) /**< INT_FL0_TXLOI Mask */
#define MXC_V_I2C_INT_FL0_TXLOI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL0_TXLOI_INACTIVE Value */
#define MXC_S_I2C_INT_FL0_TXLOI_INACTIVE               (MXC_V_I2C_INT_FL0_TXLOI_INACTIVE << MXC_F_I2C_INT_FL0_TXLOI_POS) /**< INT_FL0_TXLOI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL0_TXLOI_PENDING                ((uint32_t)0x1UL) /**< INT_FL0_TXLOI_PENDING Value */
#define MXC_S_I2C_INT_FL0_TXLOI_PENDING                (MXC_V_I2C_INT_FL0_TXLOI_PENDING << MXC_F_I2C_INT_FL0_TXLOI_POS) /**< INT_FL0_TXLOI_PENDING Setting */

/**@} end of group I2C_INT_FL0_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_INT_EN0 I2C_INT_EN0
 * @brief    Interrupt Enable Register.
 * @{
 */
#define MXC_F_I2C_INT_EN0_DONEIE_POS                   0 /**< INT_EN0_DONEIE Position */
#define MXC_F_I2C_INT_EN0_DONEIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_DONEIE_POS)) /**< INT_EN0_DONEIE Mask */
#define MXC_V_I2C_INT_EN0_DONEIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_DONEIE_DIS Value */
#define MXC_S_I2C_INT_EN0_DONEIE_DIS                   (MXC_V_I2C_INT_EN0_DONEIE_DIS << MXC_F_I2C_INT_EN0_DONEIE_POS) /**< INT_EN0_DONEIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_DONEIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_DONEIE_EN Value */
#define MXC_S_I2C_INT_EN0_DONEIE_EN                    (MXC_V_I2C_INT_EN0_DONEIE_EN << MXC_F_I2C_INT_EN0_DONEIE_POS) /**< INT_EN0_DONEIE_EN Setting */

