analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_INT_EN0_IRXMIE_POS                   1 /**< INT_EN0_IRXMIE Position */
#define MXC_F_I2C_INT_EN0_IRXMIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_IRXMIE_POS)) /**< INT_EN0_IRXMIE Mask */
#define MXC_V_I2C_INT_EN0_IRXMIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_IRXMIE_DIS Value */
#define MXC_S_I2C_INT_EN0_IRXMIE_DIS                   (MXC_V_I2C_INT_EN0_IRXMIE_DIS << MXC_F_I2C_INT_EN0_IRXMIE_POS) /**< INT_EN0_IRXMIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_IRXMIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_IRXMIE_EN Value */
#define MXC_S_I2C_INT_EN0_IRXMIE_EN                    (MXC_V_I2C_INT_EN0_IRXMIE_EN << MXC_F_I2C_INT_EN0_IRXMIE_POS) /**< INT_EN0_IRXMIE_EN Setting */

#define MXC_F_I2C_INT_EN0_GCIE_POS                     2 /**< INT_EN0_GCIE Position */
#define MXC_F_I2C_INT_EN0_GCIE                         ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_GCIE_POS)) /**< INT_EN0_GCIE Mask */
#define MXC_V_I2C_INT_EN0_GCIE_DIS                     ((uint32_t)0x0UL) /**< INT_EN0_GCIE_DIS Value */
#define MXC_S_I2C_INT_EN0_GCIE_DIS                     (MXC_V_I2C_INT_EN0_GCIE_DIS << MXC_F_I2C_INT_EN0_GCIE_POS) /**< INT_EN0_GCIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_GCIE_EN                      ((uint32_t)0x1UL) /**< INT_EN0_GCIE_EN Value */
#define MXC_S_I2C_INT_EN0_GCIE_EN                      (MXC_V_I2C_INT_EN0_GCIE_EN << MXC_F_I2C_INT_EN0_GCIE_POS) /**< INT_EN0_GCIE_EN Setting */

#define MXC_F_I2C_INT_EN0_AMIE_POS                     3 /**< INT_EN0_AMIE Position */
#define MXC_F_I2C_INT_EN0_AMIE                         ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_AMIE_POS)) /**< INT_EN0_AMIE Mask */
#define MXC_V_I2C_INT_EN0_AMIE_DIS                     ((uint32_t)0x0UL) /**< INT_EN0_AMIE_DIS Value */
#define MXC_S_I2C_INT_EN0_AMIE_DIS                     (MXC_V_I2C_INT_EN0_AMIE_DIS << MXC_F_I2C_INT_EN0_AMIE_POS) /**< INT_EN0_AMIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_AMIE_EN                      ((uint32_t)0x1UL) /**< INT_EN0_AMIE_EN Value */
#define MXC_S_I2C_INT_EN0_AMIE_EN                      (MXC_V_I2C_INT_EN0_AMIE_EN << MXC_F_I2C_INT_EN0_AMIE_POS) /**< INT_EN0_AMIE_EN Setting */

#define MXC_F_I2C_INT_EN0_RXTHIE_POS                   4 /**< INT_EN0_RXTHIE Position */
#define MXC_F_I2C_INT_EN0_RXTHIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_RXTHIE_POS)) /**< INT_EN0_RXTHIE Mask */
#define MXC_V_I2C_INT_EN0_RXTHIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_RXTHIE_DIS Value */
#define MXC_S_I2C_INT_EN0_RXTHIE_DIS                   (MXC_V_I2C_INT_EN0_RXTHIE_DIS << MXC_F_I2C_INT_EN0_RXTHIE_POS) /**< INT_EN0_RXTHIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_RXTHIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_RXTHIE_EN Value */
#define MXC_S_I2C_INT_EN0_RXTHIE_EN                    (MXC_V_I2C_INT_EN0_RXTHIE_EN << MXC_F_I2C_INT_EN0_RXTHIE_POS) /**< INT_EN0_RXTHIE_EN Setting */

#define MXC_F_I2C_INT_EN0_TXTHIE_POS                   5 /**< INT_EN0_TXTHIE Position */
#define MXC_F_I2C_INT_EN0_TXTHIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_TXTHIE_POS)) /**< INT_EN0_TXTHIE Mask */
#define MXC_V_I2C_INT_EN0_TXTHIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_TXTHIE_DIS Value */
#define MXC_S_I2C_INT_EN0_TXTHIE_DIS                   (MXC_V_I2C_INT_EN0_TXTHIE_DIS << MXC_F_I2C_INT_EN0_TXTHIE_POS) /**< INT_EN0_TXTHIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_TXTHIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_TXTHIE_EN Value */
#define MXC_S_I2C_INT_EN0_TXTHIE_EN                    (MXC_V_I2C_INT_EN0_TXTHIE_EN << MXC_F_I2C_INT_EN0_TXTHIE_POS) /**< INT_EN0_TXTHIE_EN Setting */

#define MXC_F_I2C_INT_EN0_STOPIE_POS                   6 /**< INT_EN0_STOPIE Position */
#define MXC_F_I2C_INT_EN0_STOPIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_STOPIE_POS)) /**< INT_EN0_STOPIE Mask */
#define MXC_V_I2C_INT_EN0_STOPIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_STOPIE_DIS Value */
#define MXC_S_I2C_INT_EN0_STOPIE_DIS                   (MXC_V_I2C_INT_EN0_STOPIE_DIS << MXC_F_I2C_INT_EN0_STOPIE_POS) /**< INT_EN0_STOPIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_STOPIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_STOPIE_EN Value */
#define MXC_S_I2C_INT_EN0_STOPIE_EN                    (MXC_V_I2C_INT_EN0_STOPIE_EN << MXC_F_I2C_INT_EN0_STOPIE_POS) /**< INT_EN0_STOPIE_EN Setting */

#define MXC_F_I2C_INT_EN0_ADRACKIE_POS                 7 /**< INT_EN0_ADRACKIE Position */
#define MXC_F_I2C_INT_EN0_ADRACKIE                     ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_ADRACKIE_POS)) /**< INT_EN0_ADRACKIE Mask */
#define MXC_V_I2C_INT_EN0_ADRACKIE_DIS                 ((uint32_t)0x0UL) /**< INT_EN0_ADRACKIE_DIS Value */
#define MXC_S_I2C_INT_EN0_ADRACKIE_DIS                 (MXC_V_I2C_INT_EN0_ADRACKIE_DIS << MXC_F_I2C_INT_EN0_ADRACKIE_POS) /**< INT_EN0_ADRACKIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_ADRACKIE_EN                  ((uint32_t)0x1UL) /**< INT_EN0_ADRACKIE_EN Value */
#define MXC_S_I2C_INT_EN0_ADRACKIE_EN                  (MXC_V_I2C_INT_EN0_ADRACKIE_EN << MXC_F_I2C_INT_EN0_ADRACKIE_POS) /**< INT_EN0_ADRACKIE_EN Setting */

#define MXC_F_I2C_INT_EN0_ARBERIE_POS                  8 /**< INT_EN0_ARBERIE Position */
#define MXC_F_I2C_INT_EN0_ARBERIE                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_ARBERIE_POS)) /**< INT_EN0_ARBERIE Mask */
#define MXC_V_I2C_INT_EN0_ARBERIE_DIS                  ((uint32_t)0x0UL) /**< INT_EN0_ARBERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_ARBERIE_DIS                  (MXC_V_I2C_INT_EN0_ARBERIE_DIS << MXC_F_I2C_INT_EN0_ARBERIE_POS) /**< INT_EN0_ARBERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_ARBERIE_EN                   ((uint32_t)0x1UL) /**< INT_EN0_ARBERIE_EN Value */
#define MXC_S_I2C_INT_EN0_ARBERIE_EN                   (MXC_V_I2C_INT_EN0_ARBERIE_EN << MXC_F_I2C_INT_EN0_ARBERIE_POS) /**< INT_EN0_ARBERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_TOERIE_POS                   9 /**< INT_EN0_TOERIE Position */
#define MXC_F_I2C_INT_EN0_TOERIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_TOERIE_POS)) /**< INT_EN0_TOERIE Mask */
#define MXC_V_I2C_INT_EN0_TOERIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_TOERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_TOERIE_DIS                   (MXC_V_I2C_INT_EN0_TOERIE_DIS << MXC_F_I2C_INT_EN0_TOERIE_POS) /**< INT_EN0_TOERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_TOERIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_TOERIE_EN Value */
#define MXC_S_I2C_INT_EN0_TOERIE_EN                    (MXC_V_I2C_INT_EN0_TOERIE_EN << MXC_F_I2C_INT_EN0_TOERIE_POS) /**< INT_EN0_TOERIE_EN Setting */

