analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_INT_EN0_ADRERIE_POS                  10 /**< INT_EN0_ADRERIE Position */
#define MXC_F_I2C_INT_EN0_ADRERIE                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_ADRERIE_POS)) /**< INT_EN0_ADRERIE Mask */
#define MXC_V_I2C_INT_EN0_ADRERIE_DIS                  ((uint32_t)0x0UL) /**< INT_EN0_ADRERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_ADRERIE_DIS                  (MXC_V_I2C_INT_EN0_ADRERIE_DIS << MXC_F_I2C_INT_EN0_ADRERIE_POS) /**< INT_EN0_ADRERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_ADRERIE_EN                   ((uint32_t)0x1UL) /**< INT_EN0_ADRERIE_EN Value */
#define MXC_S_I2C_INT_EN0_ADRERIE_EN                   (MXC_V_I2C_INT_EN0_ADRERIE_EN << MXC_F_I2C_INT_EN0_ADRERIE_POS) /**< INT_EN0_ADRERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_DATAERIE_POS                 11 /**< INT_EN0_DATAERIE Position */
#define MXC_F_I2C_INT_EN0_DATAERIE                     ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_DATAERIE_POS)) /**< INT_EN0_DATAERIE Mask */
#define MXC_V_I2C_INT_EN0_DATAERIE_DIS                 ((uint32_t)0x0UL) /**< INT_EN0_DATAERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_DATAERIE_DIS                 (MXC_V_I2C_INT_EN0_DATAERIE_DIS << MXC_F_I2C_INT_EN0_DATAERIE_POS) /**< INT_EN0_DATAERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_DATAERIE_EN                  ((uint32_t)0x1UL) /**< INT_EN0_DATAERIE_EN Value */
#define MXC_S_I2C_INT_EN0_DATAERIE_EN                  (MXC_V_I2C_INT_EN0_DATAERIE_EN << MXC_F_I2C_INT_EN0_DATAERIE_POS) /**< INT_EN0_DATAERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_DNRERIE_POS                  12 /**< INT_EN0_DNRERIE Position */
#define MXC_F_I2C_INT_EN0_DNRERIE                      ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_DNRERIE_POS)) /**< INT_EN0_DNRERIE Mask */
#define MXC_V_I2C_INT_EN0_DNRERIE_DIS                  ((uint32_t)0x0UL) /**< INT_EN0_DNRERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_DNRERIE_DIS                  (MXC_V_I2C_INT_EN0_DNRERIE_DIS << MXC_F_I2C_INT_EN0_DNRERIE_POS) /**< INT_EN0_DNRERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_DNRERIE_EN                   ((uint32_t)0x1UL) /**< INT_EN0_DNRERIE_EN Value */
#define MXC_S_I2C_INT_EN0_DNRERIE_EN                   (MXC_V_I2C_INT_EN0_DNRERIE_EN << MXC_F_I2C_INT_EN0_DNRERIE_POS) /**< INT_EN0_DNRERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_STRTERIE_POS                 13 /**< INT_EN0_STRTERIE Position */
#define MXC_F_I2C_INT_EN0_STRTERIE                     ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_STRTERIE_POS)) /**< INT_EN0_STRTERIE Mask */
#define MXC_V_I2C_INT_EN0_STRTERIE_DIS                 ((uint32_t)0x0UL) /**< INT_EN0_STRTERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_STRTERIE_DIS                 (MXC_V_I2C_INT_EN0_STRTERIE_DIS << MXC_F_I2C_INT_EN0_STRTERIE_POS) /**< INT_EN0_STRTERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_STRTERIE_EN                  ((uint32_t)0x1UL) /**< INT_EN0_STRTERIE_EN Value */
#define MXC_S_I2C_INT_EN0_STRTERIE_EN                  (MXC_V_I2C_INT_EN0_STRTERIE_EN << MXC_F_I2C_INT_EN0_STRTERIE_POS) /**< INT_EN0_STRTERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_STOPERIE_POS                 14 /**< INT_EN0_STOPERIE Position */
#define MXC_F_I2C_INT_EN0_STOPERIE                     ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_STOPERIE_POS)) /**< INT_EN0_STOPERIE Mask */
#define MXC_V_I2C_INT_EN0_STOPERIE_DIS                 ((uint32_t)0x0UL) /**< INT_EN0_STOPERIE_DIS Value */
#define MXC_S_I2C_INT_EN0_STOPERIE_DIS                 (MXC_V_I2C_INT_EN0_STOPERIE_DIS << MXC_F_I2C_INT_EN0_STOPERIE_POS) /**< INT_EN0_STOPERIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_STOPERIE_EN                  ((uint32_t)0x1UL) /**< INT_EN0_STOPERIE_EN Value */
#define MXC_S_I2C_INT_EN0_STOPERIE_EN                  (MXC_V_I2C_INT_EN0_STOPERIE_EN << MXC_F_I2C_INT_EN0_STOPERIE_POS) /**< INT_EN0_STOPERIE_EN Setting */

#define MXC_F_I2C_INT_EN0_TXLOIE_POS                   15 /**< INT_EN0_TXLOIE Position */
#define MXC_F_I2C_INT_EN0_TXLOIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN0_TXLOIE_POS)) /**< INT_EN0_TXLOIE Mask */
#define MXC_V_I2C_INT_EN0_TXLOIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN0_TXLOIE_DIS Value */
#define MXC_S_I2C_INT_EN0_TXLOIE_DIS                   (MXC_V_I2C_INT_EN0_TXLOIE_DIS << MXC_F_I2C_INT_EN0_TXLOIE_POS) /**< INT_EN0_TXLOIE_DIS Setting */
#define MXC_V_I2C_INT_EN0_TXLOIE_EN                    ((uint32_t)0x1UL) /**< INT_EN0_TXLOIE_EN Value */
#define MXC_S_I2C_INT_EN0_TXLOIE_EN                    (MXC_V_I2C_INT_EN0_TXLOIE_EN << MXC_F_I2C_INT_EN0_TXLOIE_POS) /**< INT_EN0_TXLOIE_EN Setting */

/**@} end of group I2C_INT_EN0_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_INT_FL1 I2C_INT_FL1
 * @brief    Interrupt Status Register 1.
 * @{
 */
#define MXC_F_I2C_INT_FL1_RXOFI_POS                    0 /**< INT_FL1_RXOFI Position */
#define MXC_F_I2C_INT_FL1_RXOFI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL1_RXOFI_POS)) /**< INT_FL1_RXOFI Mask */
#define MXC_V_I2C_INT_FL1_RXOFI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL1_RXOFI_INACTIVE Value */
#define MXC_S_I2C_INT_FL1_RXOFI_INACTIVE               (MXC_V_I2C_INT_FL1_RXOFI_INACTIVE << MXC_F_I2C_INT_FL1_RXOFI_POS) /**< INT_FL1_RXOFI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL1_RXOFI_PENDING                ((uint32_t)0x1UL) /**< INT_FL1_RXOFI_PENDING Value */
#define MXC_S_I2C_INT_FL1_RXOFI_PENDING                (MXC_V_I2C_INT_FL1_RXOFI_PENDING << MXC_F_I2C_INT_FL1_RXOFI_POS) /**< INT_FL1_RXOFI_PENDING Setting */

#define MXC_F_I2C_INT_FL1_TXUFI_POS                    1 /**< INT_FL1_TXUFI Position */
#define MXC_F_I2C_INT_FL1_TXUFI                        ((uint32_t)(0x1UL << MXC_F_I2C_INT_FL1_TXUFI_POS)) /**< INT_FL1_TXUFI Mask */
#define MXC_V_I2C_INT_FL1_TXUFI_INACTIVE               ((uint32_t)0x0UL) /**< INT_FL1_TXUFI_INACTIVE Value */
#define MXC_S_I2C_INT_FL1_TXUFI_INACTIVE               (MXC_V_I2C_INT_FL1_TXUFI_INACTIVE << MXC_F_I2C_INT_FL1_TXUFI_POS) /**< INT_FL1_TXUFI_INACTIVE Setting */
#define MXC_V_I2C_INT_FL1_TXUFI_PENDING                ((uint32_t)0x1UL) /**< INT_FL1_TXUFI_PENDING Value */
#define MXC_S_I2C_INT_FL1_TXUFI_PENDING                (MXC_V_I2C_INT_FL1_TXUFI_PENDING << MXC_F_I2C_INT_FL1_TXUFI_POS) /**< INT_FL1_TXUFI_PENDING Setting */

/**@} end of group I2C_INT_FL1_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_INT_EN1 I2C_INT_EN1
 * @brief    Interrupt Staus Register 1.
 * @{
 */
#define MXC_F_I2C_INT_EN1_RXOFIE_POS                   0 /**< INT_EN1_RXOFIE Position */
#define MXC_F_I2C_INT_EN1_RXOFIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN1_RXOFIE_POS)) /**< INT_EN1_RXOFIE Mask */
#define MXC_V_I2C_INT_EN1_RXOFIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN1_RXOFIE_DIS Value */
#define MXC_S_I2C_INT_EN1_RXOFIE_DIS                   (MXC_V_I2C_INT_EN1_RXOFIE_DIS << MXC_F_I2C_INT_EN1_RXOFIE_POS) /**< INT_EN1_RXOFIE_DIS Setting */
#define MXC_V_I2C_INT_EN1_RXOFIE_EN                    ((uint32_t)0x1UL) /**< INT_EN1_RXOFIE_EN Value */
#define MXC_S_I2C_INT_EN1_RXOFIE_EN                    (MXC_V_I2C_INT_EN1_RXOFIE_EN << MXC_F_I2C_INT_EN1_RXOFIE_POS) /**< INT_EN1_RXOFIE_EN Setting */

