analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_INT_EN1_TXUFIE_POS                   1 /**< INT_EN1_TXUFIE Position */
#define MXC_F_I2C_INT_EN1_TXUFIE                       ((uint32_t)(0x1UL << MXC_F_I2C_INT_EN1_TXUFIE_POS)) /**< INT_EN1_TXUFIE Mask */
#define MXC_V_I2C_INT_EN1_TXUFIE_DIS                   ((uint32_t)0x0UL) /**< INT_EN1_TXUFIE_DIS Value */
#define MXC_S_I2C_INT_EN1_TXUFIE_DIS                   (MXC_V_I2C_INT_EN1_TXUFIE_DIS << MXC_F_I2C_INT_EN1_TXUFIE_POS) /**< INT_EN1_TXUFIE_DIS Setting */
#define MXC_V_I2C_INT_EN1_TXUFIE_EN                    ((uint32_t)0x1UL) /**< INT_EN1_TXUFIE_EN Value */
#define MXC_S_I2C_INT_EN1_TXUFIE_EN                    (MXC_V_I2C_INT_EN1_TXUFIE_EN << MXC_F_I2C_INT_EN1_TXUFIE_POS) /**< INT_EN1_TXUFIE_EN Setting */

/**@} end of group I2C_INT_EN1_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_FIFO_LEN I2C_FIFO_LEN
 * @brief    FIFO Configuration Register.
 * @{
 */
#define MXC_F_I2C_FIFO_LEN_RXLEN_POS                   0 /**< FIFO_LEN_RXLEN Position */
#define MXC_F_I2C_FIFO_LEN_RXLEN                       ((uint32_t)(0xFFUL << MXC_F_I2C_FIFO_LEN_RXLEN_POS)) /**< FIFO_LEN_RXLEN Mask */

#define MXC_F_I2C_FIFO_LEN_TXLEN_POS                   8 /**< FIFO_LEN_TXLEN Position */
#define MXC_F_I2C_FIFO_LEN_TXLEN                       ((uint32_t)(0xFFUL << MXC_F_I2C_FIFO_LEN_TXLEN_POS)) /**< FIFO_LEN_TXLEN Mask */

/**@} end of group I2C_FIFO_LEN_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_RX_CTRL0 I2C_RX_CTRL0
 * @brief    Receive Control Register 0.
 * @{
 */
#define MXC_F_I2C_RX_CTRL0_DNR_POS                     0 /**< RX_CTRL0_DNR Position */
#define MXC_F_I2C_RX_CTRL0_DNR                         ((uint32_t)(0x1UL << MXC_F_I2C_RX_CTRL0_DNR_POS)) /**< RX_CTRL0_DNR Mask */
#define MXC_V_I2C_RX_CTRL0_DNR_RESPOND                 ((uint32_t)0x0UL) /**< RX_CTRL0_DNR_RESPOND Value */
#define MXC_S_I2C_RX_CTRL0_DNR_RESPOND                 (MXC_V_I2C_RX_CTRL0_DNR_RESPOND << MXC_F_I2C_RX_CTRL0_DNR_POS) /**< RX_CTRL0_DNR_RESPOND Setting */
#define MXC_V_I2C_RX_CTRL0_DNR_DONT_RESPOND            ((uint32_t)0x1UL) /**< RX_CTRL0_DNR_DONT_RESPOND Value */
#define MXC_S_I2C_RX_CTRL0_DNR_DONT_RESPOND            (MXC_V_I2C_RX_CTRL0_DNR_DONT_RESPOND << MXC_F_I2C_RX_CTRL0_DNR_POS) /**< RX_CTRL0_DNR_DONT_RESPOND Setting */

#define MXC_F_I2C_RX_CTRL0_RXFSH_POS                   7 /**< RX_CTRL0_RXFSH Position */
#define MXC_F_I2C_RX_CTRL0_RXFSH                       ((uint32_t)(0x1UL << MXC_F_I2C_RX_CTRL0_RXFSH_POS)) /**< RX_CTRL0_RXFSH Mask */
#define MXC_V_I2C_RX_CTRL0_RXFSH_NOT_FLUSHED           ((uint32_t)0x0UL) /**< RX_CTRL0_RXFSH_NOT_FLUSHED Value */
#define MXC_S_I2C_RX_CTRL0_RXFSH_NOT_FLUSHED           (MXC_V_I2C_RX_CTRL0_RXFSH_NOT_FLUSHED << MXC_F_I2C_RX_CTRL0_RXFSH_POS) /**< RX_CTRL0_RXFSH_NOT_FLUSHED Setting */
#define MXC_V_I2C_RX_CTRL0_RXFSH_FLUSH                 ((uint32_t)0x1UL) /**< RX_CTRL0_RXFSH_FLUSH Value */
#define MXC_S_I2C_RX_CTRL0_RXFSH_FLUSH                 (MXC_V_I2C_RX_CTRL0_RXFSH_FLUSH << MXC_F_I2C_RX_CTRL0_RXFSH_POS) /**< RX_CTRL0_RXFSH_FLUSH Setting */

#define MXC_F_I2C_RX_CTRL0_RXTH_POS                    8 /**< RX_CTRL0_RXTH Position */
#define MXC_F_I2C_RX_CTRL0_RXTH                        ((uint32_t)(0xFUL << MXC_F_I2C_RX_CTRL0_RXTH_POS)) /**< RX_CTRL0_RXTH Mask */

/**@} end of group I2C_RX_CTRL0_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_RX_CTRL1 I2C_RX_CTRL1
 * @brief    Receive Control Register 1.
 * @{
 */
#define MXC_F_I2C_RX_CTRL1_RXCNT_POS                   0 /**< RX_CTRL1_RXCNT Position */
#define MXC_F_I2C_RX_CTRL1_RXCNT                       ((uint32_t)(0xFFUL << MXC_F_I2C_RX_CTRL1_RXCNT_POS)) /**< RX_CTRL1_RXCNT Mask */

#define MXC_F_I2C_RX_CTRL1_RXFIFO_POS                  8 /**< RX_CTRL1_RXFIFO Position */
#define MXC_F_I2C_RX_CTRL1_RXFIFO                      ((uint32_t)(0xFUL << MXC_F_I2C_RX_CTRL1_RXFIFO_POS)) /**< RX_CTRL1_RXFIFO Mask */

/**@} end of group I2C_RX_CTRL1_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TX_CTRL0 I2C_TX_CTRL0
 * @brief    Transmit Control Register 0.
 * @{
 */
#define MXC_F_I2C_TX_CTRL0_TXPRELD_POS                 0 /**< TX_CTRL0_TXPRELD Position */
#define MXC_F_I2C_TX_CTRL0_TXPRELD                     ((uint32_t)(0x1UL << MXC_F_I2C_TX_CTRL0_TXPRELD_POS)) /**< TX_CTRL0_TXPRELD Mask */
#define MXC_V_I2C_TX_CTRL0_TXPRELD_NORMAL              ((uint32_t)0x0UL) /**< TX_CTRL0_TXPRELD_NORMAL Value */
#define MXC_S_I2C_TX_CTRL0_TXPRELD_NORMAL              (MXC_V_I2C_TX_CTRL0_TXPRELD_NORMAL << MXC_F_I2C_TX_CTRL0_TXPRELD_POS) /**< TX_CTRL0_TXPRELD_NORMAL Setting */
#define MXC_V_I2C_TX_CTRL0_TXPRELD_PRELOAD             ((uint32_t)0x1UL) /**< TX_CTRL0_TXPRELD_PRELOAD Value */
#define MXC_S_I2C_TX_CTRL0_TXPRELD_PRELOAD             (MXC_V_I2C_TX_CTRL0_TXPRELD_PRELOAD << MXC_F_I2C_TX_CTRL0_TXPRELD_POS) /**< TX_CTRL0_TXPRELD_PRELOAD Setting */

#define MXC_F_I2C_TX_CTRL0_TXFSH_POS                   7 /**< TX_CTRL0_TXFSH Position */
#define MXC_F_I2C_TX_CTRL0_TXFSH                       ((uint32_t)(0x1UL << MXC_F_I2C_TX_CTRL0_TXFSH_POS)) /**< TX_CTRL0_TXFSH Mask */
#define MXC_V_I2C_TX_CTRL0_TXFSH_NOT_FLUSHED           ((uint32_t)0x0UL) /**< TX_CTRL0_TXFSH_NOT_FLUSHED Value */
#define MXC_S_I2C_TX_CTRL0_TXFSH_NOT_FLUSHED           (MXC_V_I2C_TX_CTRL0_TXFSH_NOT_FLUSHED << MXC_F_I2C_TX_CTRL0_TXFSH_POS) /**< TX_CTRL0_TXFSH_NOT_FLUSHED Setting */
#define MXC_V_I2C_TX_CTRL0_TXFSH_FLUSH                 ((uint32_t)0x1UL) /**< TX_CTRL0_TXFSH_FLUSH Value */
#define MXC_S_I2C_TX_CTRL0_TXFSH_FLUSH                 (MXC_V_I2C_TX_CTRL0_TXFSH_FLUSH << MXC_F_I2C_TX_CTRL0_TXFSH_POS) /**< TX_CTRL0_TXFSH_FLUSH Setting */

#define MXC_F_I2C_TX_CTRL0_TXTH_POS                    8 /**< TX_CTRL0_TXTH Position */
#define MXC_F_I2C_TX_CTRL0_TXTH                        ((uint32_t)(0xFUL << MXC_F_I2C_TX_CTRL0_TXTH_POS)) /**< TX_CTRL0_TXTH Mask */

/**@} end of group I2C_TX_CTRL0_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TX_CTRL1 I2C_TX_CTRL1
 * @brief    Transmit Control Register 1.
 * @{
 */
#define MXC_F_I2C_TX_CTRL1_TXRDY_POS                   0 /**< TX_CTRL1_TXRDY Position */
#define MXC_F_I2C_TX_CTRL1_TXRDY                       ((uint32_t)(0x1UL << MXC_F_I2C_TX_CTRL1_TXRDY_POS)) /**< TX_CTRL1_TXRDY Mask */
#define MXC_V_I2C_TX_CTRL1_TXRDY_NOT_READY             ((uint32_t)0x0UL) /**< TX_CTRL1_TXRDY_NOT_READY Value */
#define MXC_S_I2C_TX_CTRL1_TXRDY_NOT_READY             (MXC_V_I2C_TX_CTRL1_TXRDY_NOT_READY << MXC_F_I2C_TX_CTRL1_TXRDY_POS) /**< TX_CTRL1_TXRDY_NOT_READY Setting */
#define MXC_V_I2C_TX_CTRL1_TXRDY_READY                 ((uint32_t)0x1UL) /**< TX_CTRL1_TXRDY_READY Value */
#define MXC_S_I2C_TX_CTRL1_TXRDY_READY                 (MXC_V_I2C_TX_CTRL1_TXRDY_READY << MXC_F_I2C_TX_CTRL1_TXRDY_POS) /**< TX_CTRL1_TXRDY_READY Setting */

#define MXC_F_I2C_TX_CTRL1_TXLAST_POS                  1 /**< TX_CTRL1_TXLAST Position */
#define MXC_F_I2C_TX_CTRL1_TXLAST                      ((uint32_t)(0x1UL << MXC_F_I2C_TX_CTRL1_TXLAST_POS)) /**< TX_CTRL1_TXLAST Mask */
#define MXC_V_I2C_TX_CTRL1_TXLAST_PAUSE_ON_LAST        ((uint32_t)0x0UL) /**< TX_CTRL1_TXLAST_PAUSE_ON_LAST Value */
#define MXC_S_I2C_TX_CTRL1_TXLAST_PAUSE_ON_LAST        (MXC_V_I2C_TX_CTRL1_TXLAST_PAUSE_ON_LAST << MXC_F_I2C_TX_CTRL1_TXLAST_POS) /**< TX_CTRL1_TXLAST_PAUSE_ON_LAST Setting */
#define MXC_V_I2C_TX_CTRL1_TXLAST_END_ON_LAST          ((uint32_t)0x1UL) /**< TX_CTRL1_TXLAST_END_ON_LAST Value */
#define MXC_S_I2C_TX_CTRL1_TXLAST_END_ON_LAST          (MXC_V_I2C_TX_CTRL1_TXLAST_END_ON_LAST << MXC_F_I2C_TX_CTRL1_TXLAST_POS) /**< TX_CTRL1_TXLAST_END_ON_LAST Setting */

