analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/i2c_regs.h
#define MXC_F_I2C_TX_CTRL1_TXFIFO_POS                  8 /**< TX_CTRL1_TXFIFO Position */
#define MXC_F_I2C_TX_CTRL1_TXFIFO                      ((uint32_t)(0xFUL << MXC_F_I2C_TX_CTRL1_TXFIFO_POS)) /**< TX_CTRL1_TXFIFO Mask */

/**@} end of group I2C_TX_CTRL1_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_FIFO I2C_FIFO
 * @brief    Data Register.
 * @{
 */
#define MXC_F_I2C_FIFO_DATA_POS                        0 /**< FIFO_DATA Position */
#define MXC_F_I2C_FIFO_DATA                            ((uint32_t)(0xFFUL << MXC_F_I2C_FIFO_DATA_POS)) /**< FIFO_DATA Mask */

/**@} end of group I2C_FIFO_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_MSTR_MODE I2C_MSTR_MODE
 * @brief    Master Control Register.
 * @{
 */
#define MXC_F_I2C_MSTR_MODE_START_POS                  0 /**< MSTR_MODE_START Position */
#define MXC_F_I2C_MSTR_MODE_START                      ((uint32_t)(0x1UL << MXC_F_I2C_MSTR_MODE_START_POS)) /**< MSTR_MODE_START Mask */
#define MXC_V_I2C_MSTR_MODE_START_START                ((uint32_t)0x1UL) /**< MSTR_MODE_START_START Value */
#define MXC_S_I2C_MSTR_MODE_START_START                (MXC_V_I2C_MSTR_MODE_START_START << MXC_F_I2C_MSTR_MODE_START_POS) /**< MSTR_MODE_START_START Setting */

#define MXC_F_I2C_MSTR_MODE_RESTART_POS                1 /**< MSTR_MODE_RESTART Position */
#define MXC_F_I2C_MSTR_MODE_RESTART                    ((uint32_t)(0x1UL << MXC_F_I2C_MSTR_MODE_RESTART_POS)) /**< MSTR_MODE_RESTART Mask */
#define MXC_V_I2C_MSTR_MODE_RESTART_RESTART            ((uint32_t)0x1UL) /**< MSTR_MODE_RESTART_RESTART Value */
#define MXC_S_I2C_MSTR_MODE_RESTART_RESTART            (MXC_V_I2C_MSTR_MODE_RESTART_RESTART << MXC_F_I2C_MSTR_MODE_RESTART_POS) /**< MSTR_MODE_RESTART_RESTART Setting */

#define MXC_F_I2C_MSTR_MODE_STOP_POS                   2 /**< MSTR_MODE_STOP Position */
#define MXC_F_I2C_MSTR_MODE_STOP                       ((uint32_t)(0x1UL << MXC_F_I2C_MSTR_MODE_STOP_POS)) /**< MSTR_MODE_STOP Mask */
#define MXC_V_I2C_MSTR_MODE_STOP_STOP                  ((uint32_t)0x1UL) /**< MSTR_MODE_STOP_STOP Value */
#define MXC_S_I2C_MSTR_MODE_STOP_STOP                  (MXC_V_I2C_MSTR_MODE_STOP_STOP << MXC_F_I2C_MSTR_MODE_STOP_POS) /**< MSTR_MODE_STOP_STOP Setting */

#define MXC_F_I2C_MSTR_MODE_SEA_POS                    7 /**< MSTR_MODE_SEA Position */
#define MXC_F_I2C_MSTR_MODE_SEA                        ((uint32_t)(0x1UL << MXC_F_I2C_MSTR_MODE_SEA_POS)) /**< MSTR_MODE_SEA Mask */
#define MXC_V_I2C_MSTR_MODE_SEA_7BIT_ADDR              ((uint32_t)0x0UL) /**< MSTR_MODE_SEA_7BIT_ADDR Value */
#define MXC_S_I2C_MSTR_MODE_SEA_7BIT_ADDR              (MXC_V_I2C_MSTR_MODE_SEA_7BIT_ADDR << MXC_F_I2C_MSTR_MODE_SEA_POS) /**< MSTR_MODE_SEA_7BIT_ADDR Setting */
#define MXC_V_I2C_MSTR_MODE_SEA_10BIT_ADDR             ((uint32_t)0x1UL) /**< MSTR_MODE_SEA_10BIT_ADDR Value */
#define MXC_S_I2C_MSTR_MODE_SEA_10BIT_ADDR             (MXC_V_I2C_MSTR_MODE_SEA_10BIT_ADDR << MXC_F_I2C_MSTR_MODE_SEA_POS) /**< MSTR_MODE_SEA_10BIT_ADDR Setting */

/**@} end of group I2C_MSTR_MODE_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_CLK_LO I2C_CLK_LO
 * @brief    Clock Low Register.
 * @{
 */
#define MXC_F_I2C_CLK_LO_SCL_LO_POS                    0 /**< CLK_LO_SCL_LO Position */
#define MXC_F_I2C_CLK_LO_SCL_LO                        ((uint32_t)(0x1FFUL << MXC_F_I2C_CLK_LO_SCL_LO_POS)) /**< CLK_LO_SCL_LO Mask */

/**@} end of group I2C_CLK_LO_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_CLK_HI I2C_CLK_HI
 * @brief    Clock high Register.
 * @{
 */
#define MXC_F_I2C_CLK_HI_SCL_HI_POS                    0 /**< CLK_HI_SCL_HI Position */
#define MXC_F_I2C_CLK_HI_SCL_HI                        ((uint32_t)(0x1FFUL << MXC_F_I2C_CLK_HI_SCL_HI_POS)) /**< CLK_HI_SCL_HI Mask */

/**@} end of group I2C_CLK_HI_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_TIMEOUT I2C_TIMEOUT
 * @brief    Timeout Register
 * @{
 */
#define MXC_F_I2C_TIMEOUT_TO_POS                       0 /**< TIMEOUT_TO Position */
#define MXC_F_I2C_TIMEOUT_TO                           ((uint32_t)(0xFFFFUL << MXC_F_I2C_TIMEOUT_TO_POS)) /**< TIMEOUT_TO Mask */

/**@} end of group I2C_TIMEOUT_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_SLV_ADDR I2C_SLV_ADDR
 * @brief    Slave Address Register.
 * @{
 */
#define MXC_F_I2C_SLV_ADDR_SLA_POS                     0 /**< SLV_ADDR_SLA Position */
#define MXC_F_I2C_SLV_ADDR_SLA                         ((uint32_t)(0x3FFUL << MXC_F_I2C_SLV_ADDR_SLA_POS)) /**< SLV_ADDR_SLA Mask */

#define MXC_F_I2C_SLV_ADDR_EA_POS                      15 /**< SLV_ADDR_EA Position */
#define MXC_F_I2C_SLV_ADDR_EA                          ((uint32_t)(0x1UL << MXC_F_I2C_SLV_ADDR_EA_POS)) /**< SLV_ADDR_EA Mask */
#define MXC_V_I2C_SLV_ADDR_EA_7BIT_ADDR                ((uint32_t)0x0UL) /**< SLV_ADDR_EA_7BIT_ADDR Value */
#define MXC_S_I2C_SLV_ADDR_EA_7BIT_ADDR                (MXC_V_I2C_SLV_ADDR_EA_7BIT_ADDR << MXC_F_I2C_SLV_ADDR_EA_POS) /**< SLV_ADDR_EA_7BIT_ADDR Setting */
#define MXC_V_I2C_SLV_ADDR_EA_10BIT_ADDR               ((uint32_t)0x1UL) /**< SLV_ADDR_EA_10BIT_ADDR Value */
#define MXC_S_I2C_SLV_ADDR_EA_10BIT_ADDR               (MXC_V_I2C_SLV_ADDR_EA_10BIT_ADDR << MXC_F_I2C_SLV_ADDR_EA_POS) /**< SLV_ADDR_EA_10BIT_ADDR Setting */

/**@} end of group I2C_SLV_ADDR_Register */

/**
 * @ingroup  i2c_registers
 * @defgroup I2C_DMA I2C_DMA
 * @brief    DMA Register.
 * @{
 */
#define MXC_F_I2C_DMA_TXEN_POS                         0 /**< DMA_TXEN Position */
#define MXC_F_I2C_DMA_TXEN                             ((uint32_t)(0x1UL << MXC_F_I2C_DMA_TXEN_POS)) /**< DMA_TXEN Mask */
#define MXC_V_I2C_DMA_TXEN_DIS                         ((uint32_t)0x0UL) /**< DMA_TXEN_DIS Value */
#define MXC_S_I2C_DMA_TXEN_DIS                         (MXC_V_I2C_DMA_TXEN_DIS << MXC_F_I2C_DMA_TXEN_POS) /**< DMA_TXEN_DIS Setting */
#define MXC_V_I2C_DMA_TXEN_EN                          ((uint32_t)0x1UL) /**< DMA_TXEN_EN Value */
#define MXC_S_I2C_DMA_TXEN_EN                          (MXC_V_I2C_DMA_TXEN_EN << MXC_F_I2C_DMA_TXEN_POS) /**< DMA_TXEN_EN Setting */

#define MXC_F_I2C_DMA_RXEN_POS                         1 /**< DMA_RXEN Position */
#define MXC_F_I2C_DMA_RXEN                             ((uint32_t)(0x1UL << MXC_F_I2C_DMA_RXEN_POS)) /**< DMA_RXEN Mask */
#define MXC_V_I2C_DMA_RXEN_DIS                         ((uint32_t)0x0UL) /**< DMA_RXEN_DIS Value */
#define MXC_S_I2C_DMA_RXEN_DIS                         (MXC_V_I2C_DMA_RXEN_DIS << MXC_F_I2C_DMA_RXEN_POS) /**< DMA_RXEN_DIS Setting */
#define MXC_V_I2C_DMA_RXEN_EN                          ((uint32_t)0x1UL) /**< DMA_RXEN_EN Value */
#define MXC_S_I2C_DMA_RXEN_EN                          (MXC_V_I2C_DMA_RXEN_EN << MXC_F_I2C_DMA_RXEN_POS) /**< DMA_RXEN_EN Setting */

/**@} end of group I2C_DMA_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_I2C_REGS_H_
